# Файл содержит последовательность целых чисел, по модулю не превышающих 10000.
# Назовём парой два идущих подряд элемента последовательности.
#
# Задание17
#
# Определите количество пар, для которых выполняются следующие условия:
#
# —запись элементов пары заканчивается одной и той же цифрой;
#
# —ровно один элемент из пары делится без остатка на 7;
#
# —сумма квадратов элементов пары не превышает квадрат наименьшего из элементов последовательности,
# запись которых заканчивается цифрой 7.
#
#
#
# В ответе запишите два числа: сначала количество найденных пар,
# затем максимальную величину суммы квадратов элементов этих пар.


