# Файл содержит последовательность натуральных чисел, не превышающих 100000.
# Назовём четвёркой четыре идущих подряд элемента последовательности.
#
# Определите количество четвёрок, для которых выполняются следующие условия:
# —в четвёрке есть хотя бы два пятизначных числа и хотя бы одно не пятизначное;
# —в четвёрке больше чисел, кратных 3, чем чисел, кратных 7;
# —сумма элементов четвёрки больше максимального элемента последовательности, запись которого заканчивается на 538,
# но меньше удвоенного значения этого элемента. Гарантируется, что в последовательности есть хотя бы один элемент, запись которого заканчивается на 538.
#
# В ответе запишите два числа: сначала количество найденных четвёрок, затем максимальную величину суммы элементов этих четвёрок.


# Ответ: 260 106865

